Repository: Orlandoxx/e2openplugin-Foreca
Catalog: plugin/locale/*/LC_MESSAGES/Foreca.po
Languages: fi

source: Foreca Weather Forecast
fi: Foreca Sääennuste

source: Weather forecast for the upcoming 10 days
fi: Sääennuste seuraavat 10 päivää

source: better
fi: parempi

source: simple
fi: yksinkertainen

source: black
fi: musta

source: blue
fi: sininen

source: green
fi: vihreä

source: red
fi: punainen

source: yellow
fi: keltainen

source: Imperial (C, mph)
fi: Brittiläinen (C, mph)

source: Metric (C, km/h)
fi: Metrinen (C, km/h)

source: Metric (C, m/s)
fi: Metrinen (C, m/s)

source: US (F, mph)
fi: US (F, m/h)

source: Temp
fi: Lämpötila

source: Wind
fi: Tuuli

source: Please wait ...
fi: Odota ...

source: Week
fi: Viikko

source: City
fi: Kaupunki

source: Favorite 1
fi: Suosikki 1

source: Favorite 2
fi: Suosikki 2

source: Home
fi: Kotipaikka

source: Legend
fi: Näppäintiedot

source: Maps
fi: Kartat

source: Version
fi: Versio

source: Exit - End
fi: EXIT - Poistu

source: Menu - Weather maps
fi: MENU - Sääkartat

source: Info - Legend
fi: INFO - Karttamerkkien selitykset

source: OK - City
fi: OK - Kaupunki

source: Left - Previous day
fi: Vasen - Edellinen päivä

source: Right - Next day
fi: Oikea - Seuraava päivä

source: Up - Previous page
fi: Ylös - Edellinen sivu

source: Down - Next page
fi: Alas - Seuraava sivu

source: Left arrow - Previous day
fi: Vasen nuoli - Edellinen päivä

source: Right arrow - Next day
fi: Oikea nuoli - Seuraava päivä

source: Red - Weekoverview
fi: Punainen - Viikkoennuste

source: Green - Favorite 1
fi: Vihreä - Suosikki 1

source: Yellow - Favorite 2
fi: Keltainen - Suosikki 2

source: Blue - Home
fi: Sininen - Kotipaikka

source: 0 - Today
fi: 0 - Tänään

source: 1 - Today + 1 day
fi: 1 - Tänään + 1 päivä

source: 2 - Today + 2 days
fi: 2 - Tänään + 2 päivää

source: 3 - Today + 3 days
fi: 3 - Tänään + 3 päivää

source: 4 - Today + 4 days
fi: 4 - Tänään + 4 päivää

source: 5 - Today + 5 days
fi: 5 - Tänään + 5 päivää

source: 6 - Today + 6 days
fi: 6 - Tänään + 6 päivää

source: 7 - Today + 7 days
fi: 7 - Tänään + 7 päivää

source: 8 - Today + 8 days
fi: 8 - Tänään + 8 päivää

source: 9 - Today + 9 days
fi: 9 - Tänään + 9 päivää

source: VERSION = %s
fi: VERSIO = %s

source: < > = Prognosis next/previous day
fi: < > = Ennuste seuraava/edellinen päivä

source: 0 - 9 = Prognosis (x) days from now
fi: 0 - 9 = Ennuste seuraavat (x) päivää

source: VOL+/- = Fast scroll 100 (City choice)
fi: VOL+/- = Nopea selaus 100 (kaupunkia)

source: Ch+/- = Fast scroll 500 (City choice)
fi: CH+/- = Nopea selaus 500 (kaupunkia)

source: INFO = This information
fi: INFO = Tämä informaatio

source: MENU = Satellite photos and maps
fi: MENU = Satelliittikuvat ja -kartat

source: OK = Go to City Panel
fi: OK = Siirry kaupunkipaneeliin

source: Red = Temperature chart for the upcoming 5 days
fi: Punainen = Lämpötilakaavio seuraaville 5 päivälle

source: Green = Go to Favorite 1
fi: Vihreä = Siirry Suosikkiin 1

source: Yellow = Go to Favorite 2
fi: Keltainen = Siirry Suosikkiin 2

source: Blue = Go to Home
fi: Sininen = Siirry Kotipaikkaan

source: Wind direction = Arrow to right: Wind from the West
fi: Tuulensuunta = Nuoli oikealle: Tuuli lännestä

source: Select a city
fi: Valitse kaupunki

source: Forecast
fi: Ennuste

source: Left - Previous page
fi: Vasen - Edellinen sivu

source: Right - Next page
fi: Oikea - Seuraava sivu

source: Up - Previous
fi: Ylös - Edellinen

source: Down - Next
fi: Alas - Seuraava

source: OK - Select
fi: OK - Valitse

source: Green - Assign to Favorite 1
fi: Vihreä - Liitä suosikkiin 1

source: Yellow - Assign to Favorite 2
fi: Keltainen - Liitä suosikkiin 2

source: Blue - Assign to Home
fi: Sininen - Liitä kotipaikkaan

source: Channel+ - 500 back
fi: CH+ - 500 taaksepäin

source: Channel- - 500 forward
fi: CH- - 500 eteenpäin

source: Volume- - 100 forward
fi: VOL- - 100 eteenpäin

source: Volume+ - 100 back
fi: VOL+ - 100 taaksepäin

source: This city is stored as home!
fi: Tämä kaupunki on tallennettu kotipaikaksi!

source: This city is stored as favorite 1!
fi: Tämä kaupunki on tallennettu suosikiksi 1!

source: This city is stored as favorite 2!
fi: Tämä kaupunki on tallennettu suosikiksi 2!

source: Satellite photos
fi: Satelliittikuvat

source: Continents
fi: Maanosat

source: Europe
fi: Eurooppa

source: Germany
fi: Saksa

source: Settings
fi: Asetukset

source: Red - Continents
fi: Punainen - Maanosat

source: Green - Europe
fi: Vihreä - Eurooppa

source: Yellow - Germany
fi: Keltainen - Saksa

source: Blue - Settings
fi: Sininen - Asetukset

source: OK - Show
fi: OK - Näytä

source: Weather map Video
fi: Sääkarttavideo

source: Showerradar Video
fi: Sadetutkavideo

source: Temperature Video
fi: Lämpötilavideo

source: Cloudcover Video
fi: Pilvipeitevideo

source: Air pressure
fi: Ilmanpaine

source: Bavaria
fi: Baijeri

source: Berlin
fi: Berliini

source: Hamburg
fi: Hampuri

source: Lower Saxony
fi: Ala-Saksi

source: North Rhine-Westphalia
fi: Nordrhein-Westfalen

source: Rhineland-Palatine
fi: Rheinland-Pfalz

source: Saxony
fi: Saksi

source: Saxony-Anhalt
fi: Saksi-Anhalt

source: Austria
fi: Itävalta

source: Belgium
fi: Belgia

source: Czech Republic
fi: Tšekki

source: Denmark
fi: Tanska

source: France
fi: Ranska

source: Greece
fi: Kreikka

source: Great Britain
fi: Iso-Britannia

source: Hungary
fi: Unkari

source: Ireland
fi: Irlanti

source: Italy
fi: Italia

source: Luxembourg
fi: Luxemburg

source: Netherlands
fi: Alankomaat

source: Poland
fi: Puola

source: Portugal
fi: Portugali

source: Russia
fi: Venäjä

source: Spain
fi: Espanja

source: Switzerland
fi: Sveitsi

source: North Africa
fi: Pohjois-Afrikka

source: South Africa
fi: Etelä-Afrikka

source: North America
fi: Pohjois-Amerikka

source: Middle America
fi: Keski-Amerikka

source: South America
fi: Etelä-Amerikka

source: Middle East
fi: Lähi-itä

source: East Asia
fi: Itä-Aasia

source: Southeast Asia
fi: Kaakkois-Aasia

source: Middle Asia
fi: Keski-Aasia

source: Please wait, photo is being loaded ...
fi: Odota, valokuvaa ladataan...

source: SlideShow Settings
fi: Diaesitysasetukset

source: Cancel
fi: Peruuta

source: Save
fi: Tallenna

source: Select units
fi: Valitse yksiköt

source: Select time format
fi: Valitse ajan muoto

source: City names as labels in the Main screen
fi: Kaupunkien nimet päänäytön nimikkeinä

source: Frame size in full view
fi: Kehyskoko koko näkymässä

source: Font size in slideshow
fi: Fonttikoko diaesityksessä

source: Scaling Mode
fi: Skaalaustila

source: Slide Time (seconds)
fi: Dian aika (sekunteina)

source: Show Infoline
fi: Näytä inforivi

source: Textcolor
fi: Tekstin väri

source: Backgroundcolor
fi: Taustaväri

source: Slide picture in loop
fi: Dian kuva luupissa

source: Display in extensions menu
fi: Näytä laajennusvalikossa

source: Clear
fi: Selkeää

source: Mostly clear
fi: Melkein selkeää

source: Partly cloudy
fi: Puolipilvistä

source: Partly cloudy and light rain
fi: Puolipilvistä, mahdollisesti vähäistä sadetta

source: Partly cloudy and showers
fi: Puolipilvistä, ajoittain sadetta

source: Partly cloudy, thunderstorms with rain
fi: Puolipilvistä, ukkosta

source: Partly cloudy and light wet snow
fi: Puolipilvistä, mahdollisesti vähäistä räntäsadetta

source: Partly cloudy and wet snow showers
fi: Puolipilvistä, ajoittain räntäsadetta

source: Partly cloudy and light snow
fi: Puolipilvistä, mahdollisesti vähäistä lumisadetta

source: Partly cloudy and snow showers
fi: Puolipilvistä, ajoittaista lumisadetta

source: Cloudy
fi: Melko pilvistä

source: Cloudy and light rain
fi: Melko pilvistä, mahdollisesti vähäistä sadetta

source: Cloudy and showers
fi: Melko pilvistä, ajoittaista sadetta

source: Cloudy, thunderstorms with rain
fi: Melko pilvistä, ukkosta

source: Cloudy and light wet snow
fi: Enimmäkseen pilvistä ja heikkoa räntäsadetta

source: Cloudy and wet snow showers
fi: Melko pilvistä, ajoittaista räntäsadetta

source: Cloudy and light snow
fi: Melko pilvistä, mahdollisesti vähäistä lumisadetta

source: Cloudy and snow showers
fi: Melko pilvistä, ajoittaista lumisadetta

source: Overcast
fi: Pilvistä

source: Overcast and light rain
fi: Pilvistä, mahdollisesti vähäistä sadetta

source: Overcast and showers
fi: Pilvistä, ajoittaista sadetta

source: Overcast and rain
fi: Pilvistä, runsasta sadetta

source: Overcast, thunderstorms with rain
fi: Pilvistä, ukkosta

source: Overcast and light wet snow
fi: Pilvistä, mahdollisesti vähäistä räntäsadetta

source: Overcast and wet snow showers
fi: Pilvistä, ajoittaista räntäsadetta

source: Overcast and wet snow
fi: Pilvistä, runsasta räntäsadetta

source: Overcast and light snow
fi: Pilvistä, mahdollisesti vähäistä lumisadetta

source: Overcast and snow showers
fi: Pilvistä, ajoittaista lumisadetta

source: Overcast and snow
fi: Pilvistä, runsasta lumisadetta

source: Thin upper cloud
fi: Ohutta yläpilveä

source: Fog
fi: Sumua

source: Partly cloudy, possible thunderstorms with rain
fi: Puolipilvistä, mahdollisesti ukkosta

source: Feels like:
fi: Tuntuu kuin:

source: Precip chance:
fi: Sateen mahdollisuus:

source: Humidity:
fi: Kosteus:

source: Monday
fi: Maanantai

source: Tuesday
fi: Tiistai

source: Wednesday
fi: Keskiviikko

source: Thursday
fi: Torstai

source: Friday
fi: Perjantai

source: Saturday
fi: Lauantai

source: Sunday
fi: Sunnuntai

source: January
fi: tammikuuta

source: February
fi: helmikuuta

source: March
fi: maaliskuuta

source: April
fi: huhtikuuta

source: May
fi: toukokuuta

source: June
fi: kesäkuuta

source: July
fi: heinäkuuta

source: August
fi: elokuuta

source: September
fi: syyskuuta

source: October
fi: lokakuuta

source: November
fi: marraskuuta

source: December
fi: joulukuuta

source: Open Keyboard
fi: Avaa näppäimistö

source: Search your City
fi: Etsi kaupunkiasi

source: No City found in search!!!
fi: Kaupunkia ei löydy!!!

source: An error occurred during search!
fi: Virhe hakutoiminnossa!
